Revit 2027 API
FabricationConfiguration.CanBeSwapped Method
 Checks if the fabrication configuration can be swapped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeSwapped()
Public Function CanBeSwapped As Boolean
public:
bool CanBeSwapped()
member CanBeSwapped : unit -> bool
Return Value
Boolean
 True if the fabrication configuration can be swapped, false otherwise.
Remarks
 Swapping configuration is not permitted if the existing configuration has already been used to create fabrication part elements in the document.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace